app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def create

    puts 'post params', params
    @restaurant = Restaurant.new(restaurant_params)

    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "description", "img", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "agas"], ["description", "asd"], ["img", "sdf"], ["link", "adsf"], ["created_at", "2020-01-15 21:36:35.139839"], ["updated_at", "2020-01-15 21:36:35.139839"]]

  def update
    puts 'params', params
    @restaurant = Restaurant.find(params[:id])
    puts 'name', @restaurant.name
    if @restaurant.update(restaurant_params)
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "restaurants" SET "description" = $1, "img" = $2, "link" = $3, "updated_at" = $4 WHERE "restaurants"."id" = $5  [["description", "this food is really good "], ["img", "sdf"], ["link", "https://detroitmopedworks.com"], ["updated_at", "2020-01-15 22:00:50.854970"], ["id", 19]]

  def destroy
    @restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 17]]

    def set_restaurant
      @restaurant = Restaurant.find(params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]