app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT "reviews".* FROM "reviews"

  def create
    @review = Review.new(review_params)
    @review.restaurant_id = params[:restaurant_id]
    if @review.save
---
INSERT INTO "reviews" ("name", "rating", "comment", "created_at", "updated_at", "restaurant_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Ali"], ["rating", "4/5"], ["comment", "love the lemonade from here"], ["created_at", "2020-01-15 15:03:58.915162"], ["updated_at", "2020-01-15 15:03:58.915162"], ["restaurant_id", 15]]